{"about-caustics":{"title":"About Caustics","links":["getting-started","support/troubleshooting-and-known-limitations"],"tags":[],"content":"Thanks for your interest in Water Caustics for URP!\nYou have already downloaded Water Caustics for URP and want to get started? Read the Getting Started section.\nYou can get Linework from the asset store here\nassetstore.unity.com/packages/vfx/shaders/water-caustics-for-urp-221106\n\nAsset Store: assetstore.unity.com/packages/vfx/shaders/water-caustics-for-urp-221106\nDiscord: discord.gg/cFfQGzQdPn\nGetting Started | Troubleshooting and Known Limitations"},"getting-started":{"title":"Getting Started","links":["support/compatibility","support/troubleshooting-and-known-limitations","support/contact","fast-outline","soft-outline","wide-outline","edge-detection","surface-fill"],"tags":[],"content":"How to get started using Water Caustics for URP.\nBefore using Water Caustics for URP, review the following important notes.\n\n\n                  \n                  License Agreement \n                  \n                \n\nThe source code included with this asset can be freely modified to suit your needs. However, please adhere to the following restrictions:\n\nDo not upload the source code to any public repository (e.g., GitHub). You may omit the files or keep the repository private.\nDo not use any part of this source code in new publications on the Asset Store.\nDo not resell the source code, either in full or in part, except as an integrated component of your game.\n\nRedistribution of Water Caustics for URP is not allowed. If you obtained a copy through other channels than the Asset Store, please respect my work of developing/maintaining Water Caustics for URP by purchasing a legitimate copy from the Asset Store.\nassetstore.unity.com/packages/vfx/shaders/water-caustics-for-urp-221106\n\n\nInstallation\nLet’s get started.\n\n\n                  \n                  Compatibility \n                  \n                \n\nBefore installing, carefully review the Compatibility section to verify that Linework will work with your project.\n\n\nAfter importing the asset into Unity, you will be greeted by the support window. In the Configure tab, click on the Detect button. This will verify that everything is set up correctly in your project. If the support window does not open, you can open it by clicking Window &gt; Linework &gt; About and Support.\n\nIf the result is showing only green checkmarks, you are good to go! If not, see the Troubleshooting and Known Limitations section or Contact me.\nAdding Outlines and Fills\nTo get started, open the Universal Renderer Data asset, click on Add Renderer Feature and select the outline/fill effect that you would like to add. Each outline effect stores its settings in a separate object that you can create somewhere in your Assets folder, by right-clicking and selecting Create &gt; Linework &gt; Outline Settings.\n\nDrag the created settings into the object slot of the renderer feature. You can now click the Open button to open the settings.\n\nBy default, the outline should be applied to the whole scene.\nDepending on which outline/fill effect you are using, you can find more detailed information about the different configuration options here.\n\nFast Outline\nSoft Outline\nWide Outline\nEdge Detection\nSurface Fill"},"how-to-guides/caustics-volume":{"title":"Caustics Volume","links":[],"tags":[],"content":"How to place caustics.\nCaustics may be positioned using caustics volumes. These volumes are cubes that may be translated, rotated and scaled. Caustics will show up wherever the volume intersects with existing scene geometry.\nTo help you, the caustics volume shows debug lines of the wireframe of the volume. The lines are shown in white where they intersect with existing scene geometry.\n\nThe debug view may be hidden using the Display Debug Overlay toggle in the script inspector.\n"},"how-to-guides/shader-properties":{"title":"Shader Properties","links":[],"tags":[],"content":"How to use this asset.\nThis asset comes with a nice and clean material editor to edit the properties of the caustics. This editor will simply show up in the material section in the inspector if you have the caustics volume selected.\nTexture\nYou can specify which caustics texture is used and at what scale it is displayed. You can also control the movement speed of the caustics.\n\nVisuals\nHere you can control the visuals of the caustics. There is a slider to control the intensity of the effect. The chromatic aberration slider controls how much the caustics appear to fall out into the RGB color channels. This is to mimic the light rays refracting through the water surface at different angles depending on the wavelength.\n\nLight influence\nThe caustics may be influenced by the light in the scene. The luminance mask will mask out the caustics based on the scene luminance. This is to keep the caustics from showing up in shadowed areas.\n\nEdge fading\nThe caustics will be shown within the caustics volume. To soften the edges of the caustics effect, you can fade them out towards the edges.\n"},"support/changelog":{"title":"Changelog","links":[],"tags":[],"content":"All notable changes to this package will be documented in this file.\nThe format is based on Keep a Changelog, and this project adheres to Semantic Versioning.\n[Unreleased]\nFixed\n\nfixed warning message on asset import about incorrect package name\n\n[1.0.0] - 2023-08-25\nThe initial version of Linework.\nAdded\n\nAdded the Fast Outline effect for rendering simple outlines using vertex extrusion\nAdded the Soft Outline effect for rendering soft and glowy outlines\nAdded the Wide Outline effect for rendering consistent and smooth outlines\nAdded the Edge Detection effect for rendering a full-screen outline effect that applies to the whole scene\nAdded the Surface Fill effect for rendering screen-space fill effects and patterns\n"},"support/compatibility":{"title":"Compatibility","links":["support/contact"],"tags":[],"content":"Check if Linework will work in your project.\n\n\n                  \n                  Compatibility \n                  \n                \n\nLinework is compatible with Unity 6 and the Universal Render Pipeline. Other combinations are not supported.\nIn Unity 6, make sure that Compatibility Mode (Render Graph Disabled) is NOT CHECKED since this asset relies on the Render Graph API. The Compatibility Mode is disabled by default on new Unity 6 projects but may be enabled if you upgrade to Unity 6. Support for both modes will be added soon.\n\n\nUnity Versions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUnity VersionURP VersionStatus617.0.0✅ supported2022 and olderx.y.z❌ not supported\nRender Pipelines\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPipelineStatusBuilt-In (legacy)❌ not supportedLight-Weight (deprecated)❌ not supportedUniversal (URP)✅ supportedHigh-Definition (HDRP)❌ not supportedCustom❌ not supported\nPlatforms\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlatformStatusWindows✅ supportedmacOS✅ supportedLinux❔ not testedWebGL 1.0❔ not testedWebGL 2.0❔ not testedAndroid❔ not testediOS❔ not testedPlaystation 5❔ not testedXbox Series X❔ not testedNintendo Switch❔ not testedPlaystation 4❔ not testedXbox One X❔ not testedOculus Quest❔ not testedDesktop VR❔ not testedApple Vision Pro❔ not tested\nGraphics APIs\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGraphics APIStatusOpenGLCore❌ not supportedOpenGLES3❔ not testedVulkan✅ supportedDirect3D11✅ supportedDirect3D12❔ not testedMetal✅ supported\nOther\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBatchingStatusSRP Batcher✅ supportedStatic Batching❌ not supportedGPU Instancing❌ not supported\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRendering PathStatusForward✅ supportedForward +❔ not testedDeferred❔ not tested\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nColor SpaceStatusLinear✅ supportedGamma❔ not tested\nOther Assets\nLinework should not run in any issues with other assets. If you encounter any issues, please see the Contact section to get in touch."},"support/contact":{"title":"Contact","links":[],"tags":[],"content":"How to get in touch.\nHi! I am Alexander, the developer of Water Caustics for URP.\nYou can reach me in the following ways:\nDiscord: discord.com/invite/cFfQGzQdPn\nTwitter: @alexanderameye\nEmail: alexanderameye@gmail.com\nWebsite: ameye.dev"},"support/troubleshooting-and-known-limitations":{"title":"Troubleshooting and Known Limitations","links":["support/contact","roadmap","support/compatibility","fast-outline","soft-outline","wide-outline","edge-detection","surface-fill"],"tags":[],"content":"Some frequently encountered issues and how to resolve them.\nCan’t find a solution to your issue here? Contact me.\nKnown Limitations (fixes in progress)\n\n\n                  \n                  Soft/Wide Outline + MSAA \n                  \n                \n\nHaving Anti Aliasing (MSAA) enabled in the Universal Render Pipeline Asset will result in an error and the outlines will not render.\nThis will be fixed in a future update.\n\n\n\n\n\n                  \n                  Alpha cutout \n                  \n                \n\nAlpha cutout is not currently supported but support will be added soon. See the Roadmap.\n\n\n\n\n                  \n                  VR support \n                  \n                \n\nVR is not currently supported but support will be added soon. See the Roadmap.\n\n\n\n\n                  \n                  Sprite support \n                  \n                \n\nSprites are not currently supported but support will be added soon. See the Roadmap.\n\n\nKnown Limitations (by design)\n\n\n                  \n                  Temporal Anti-aliasing (TAA) \n                  \n                \n\nIf the outline is set to render After Post Processing, the outline will jitter more than the rest of the scene.\n\n\n\n\n                  \n                  Volume System \n                  \n                \n\nThis asset has not been designed to work together with the URP Volume System.\n\n\n\n\n                  \n                  Deferred Rendering \n                  \n                \n\nLinework is not known to be compatible with the deferred rendering mode.\n\n\n\n\n                  \n                  DOTS Renderer \n                  \n                \n\nLinework is not known to be compatible with the DOTS renderer.\n\n\n\n\n                  \n                  Particles and transparent objects \n                  \n                \n\nAdding outlines to particles or other transparent objects is not supported.\n\n\nCompatibility\nSee Compatibility for more information.\nGeneral\n\n\n                  \n                  Outline/fill does not behave as expected \n                  \n                \n\nWhen combining multiple types of outline effects or fills, it could sometimes be that their stencil masks interact with each other. Enable the Force Clear Stencil toggle in the settings to see if this resolves the issue. If you encounter an issue like this, please Contact me since I treat it as a bug.\n\n\n\n\n                  \n                  Outline/fill has influence on other rendering effects \n                  \n                \n\nPlease Contact me.\n\n\nFast Outline\nSee Fast Outline for more information.\nSoft Outline\nSee Soft Outline for more information.\nWide Outline\nSee Wide Outline for more information.\nEdge Detection\nSee Edge Detection for more information.\nSurface Fill\nSee Surface Fill for more information."},"index":{"title":"About Linework","links":["getting-started","common-questions","roadmap","support/troubleshooting-and-known-limitations"],"tags":[],"content":"Thanks for your interest in Linework!\nIf you have already installed Linework and you want to get started? Read the Getting Started section.\n\n\n                  \n                  Linework for Unity - A Practical Toolkit for Rendering Outlines \n                  \n                \n\nWith Linework you can render high-quality outlines in Unity. Multiple techniques can be used, balancing visual quality and performance. Both full-screen outlines (for outlined art-styles) as per-object outlines are supported. You can also combine outlines with fill effects such as patterns and overlays. The toolkit is designed to be feature-rich and straightforward to use.\n\n\nYou can get Linework from the asset store here\nassetstore.unity.com/packages/slug/294140.\n\nUseful Links\nAsset Store: assetstore.unity.com/packages/slug/294140\nDiscord: discord.gg/cFfQGzQdPn\nGetting Started Common Questions Roadmap Troubleshooting and Known Limitations"}}